# Cleaning and Transforming Data

## Bringing in Data

* `pd.read_csv('./DOHMH_Dog_Bite_Data.csv')`
    * lots of options
    * https://pandas.pydata.org/pandas-docs/stable/reference/api/pandas.read_csv.html
* `read_excel`
* `read_json`
* etc. (see book)

## Initial Exploration

* show: `head(n)`, `tail(n)`, `sample(n)`
* meta abt columns: `dtype`, `count()`, `info()`
* meta: `describe()`

## Working on Columns

* what data do we have? `dtype`
* count by types... but note, nan is considered float!?
    * `map(lambda x: type(x))`
* what are some actual values... value_counts()
* want to temporarily drop rows with a null in a column?
    * `tmp = df.dropna()`
* sort a Series by index:
    * `sort_index()`

## Altering Display Options

* `pd.option_context('display.max_rows', 500)`

## Work on Specific Columns

btw, bectorized methods / accessors on series:

* use `.dt` or `.str`
* call methods from there

conversions/handling columns

* numeric, but object or str
    * `astype('float64')`... but!!!!
    * map to use arbitrary functions like replace
        * note!!!! `na_action='ignore'`
    * use more sophisticated function (this is tricky)
    * `pd.to_numeric(series, errors='coerce')`
* date, `dt`
    * convert to datetime object
        * `pd.to_datetime(series, errors='coerce')`
    * test it out on a string first
        * `pd.to_datetime('January 02 2015	')`
    * convert all date objects to month name: `.dt.month_name()`
    * convert all date objects to month number `.dt.month`
    * to graph... w/ month names
        * `import calendar`
        * `list(calendar.month_abbr)[1:]` (starts with ''????)
        * pass all to xticks
* `str`
    * `.strip()`
        * `expand=True` to create a data frame
    * `.upper()`
    * `.split()`
    
## Data Set Questions


* what's the average age of the dogs in the data set? oldest, youngest 
    * let's check what the meta info has to say abt this
    * https://data.cityofnewyork.us/Health/DOHMH-Dog-Bite-Data/rsgh-akpg
    * ah... but what r the units??? IDK!!!! ðŸ¤”
* when is the worst time of year for dog bites? (so i can go out in bubble)?
* which breed, besides the obvious, are the bite-iest (er, let's do 2nd and / or 3rd place)

In [1]:
import pandas as pd
import numpy as np

In [2]:
d = [["$229.2", 2017, 123000, "$1100", "Cupertino, US"],
     ["$211.9", 2017, 320671, "$284", "Suwon, South Korea"],
     ["$177.8", 2017, 566000, "$985",  "Seattle, US"],
     ["$154.7", 2017, 1300000, "$66", "New Taipei City, Taiwan"],
     ["$110.8", 2017, 80110, "$834", "Mountain View, US"]]

comps = ["apple", "samsung", "amazon", "foxconn", "alphabet"]
cols = ["revenue", "fy", "employees", "mcap", "location"]

c = pd.DataFrame(d, index=comps, columns=cols)

In [5]:
c

         revenue    fy  employees   mcap                 location
apple     $229.2  2017     123000  $1100            Cupertino, US
samsung   $211.9  2017     320671   $284       Suwon, South Korea
amazon    $177.8  2017     566000   $985              Seattle, US
foxconn   $154.7  2017    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8  2017      80110   $834        Mountain View, US

In [6]:
del c['fy']

In [7]:
c

         revenue  employees   mcap                 location
apple     $229.2     123000  $1100            Cupertino, US
samsung   $211.9     320671   $284       Suwon, South Korea
amazon    $177.8     566000   $985              Seattle, US
foxconn   $154.7    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8      80110   $834        Mountain View, US

In [9]:
c.drop('mcap', axis=1)

         revenue  employees                 location
apple     $229.2     123000            Cupertino, US
samsung   $211.9     320671       Suwon, South Korea
amazon    $177.8     566000              Seattle, US
foxconn   $154.7    1300000  New Taipei City, Taiwan
alphabet  $110.8      80110        Mountain View, US

In [10]:
c['employees']

apple        123000
samsung      320671
amazon       566000
foxconn     1300000
alphabet      80110
Name: employees, dtype: int64

In [11]:
c.loc['amazon', 'revenue']

'$177.8'

In [14]:
c[['revenue', 'location']]['apple':'amazon']

        revenue            location
apple    $229.2       Cupertino, US
samsung  $211.9  Suwon, South Korea
amazon   $177.8         Seattle, US

In [15]:
c.index

Index(['apple', 'samsung', 'amazon', 'foxconn', 'alphabet'], dtype='object')

In [16]:
c

         revenue  employees   mcap                 location
apple     $229.2     123000  $1100            Cupertino, US
samsung   $211.9     320671   $284       Suwon, South Korea
amazon    $177.8     566000   $985              Seattle, US
foxconn   $154.7    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8      80110   $834        Mountain View, US

In [17]:
c['state'] = pd.Series(['CA', 'CA', 'WA'], ['apple', 'alphabet', 'amazon'])

In [18]:
c

         revenue  employees   mcap                 location state
apple     $229.2     123000  $1100            Cupertino, US    CA
samsung   $211.9     320671   $284       Suwon, South Korea   NaN
amazon    $177.8     566000   $985              Seattle, US    WA
foxconn   $154.7    1300000    $66  New Taipei City, Taiwan   NaN
alphabet  $110.8      80110   $834        Mountain View, US    CA

In [19]:
np.nan

nan

In [20]:
type(np.nan)

float

In [21]:
c['employees']

apple        123000
samsung      320671
amazon       566000
foxconn     1300000
alphabet      80110
Name: employees, dtype: int64

In [22]:
c['employees'] // 100000

apple        1
samsung      3
amazon       5
foxconn     13
alphabet     0
Name: employees, dtype: int64

In [23]:
c[c['employees'] < 200000]

         revenue  employees   mcap           location state
apple     $229.2     123000  $1100      Cupertino, US    CA
alphabet  $110.8      80110   $834  Mountain View, US    CA

In [24]:
c['state']

apple        CA
samsung     NaN
amazon       WA
foxconn     NaN
alphabet     CA
Name: state, dtype: object

In [26]:
c[c['state'].isnull()]

        revenue  employees  mcap                 location state
samsung  $211.9     320671  $284       Suwon, South Korea   NaN
foxconn  $154.7    1300000   $66  New Taipei City, Taiwan   NaN

In [28]:
c['state'] = c['state'].fillna('')

In [29]:
c

         revenue  employees   mcap                 location state
apple     $229.2     123000  $1100            Cupertino, US    CA
samsung   $211.9     320671   $284       Suwon, South Korea
amazon    $177.8     566000   $985              Seattle, US    WA
foxconn   $154.7    1300000    $66  New Taipei City, Taiwan
alphabet  $110.8      80110   $834        Mountain View, US    CA

In [30]:
c['employees'].sum()

2389781

In [31]:
c['employees'].mean()

477956.2

In [32]:
c['location'].str.upper()

apple                 CUPERTINO, US
samsung          SUWON, SOUTH KOREA
amazon                  SEATTLE, US
foxconn     NEW TAIPEI CITY, TAIWAN
alphabet          MOUNTAIN VIEW, US
Name: location, dtype: object

In [35]:
tmp = c['location'].str.split(',',  expand=True)

In [36]:
c['country'] = tmp[1]

In [37]:
c

,revenue,employees,mcap,location,state,country
apple,$229.2,123000,$1100,"Cupertino, US",CA,US
samsung,$211.9,320671,$284,"Suwon, South Korea",,South Korea
amazon,$177.8,566000,$985,"Seattle, US",WA,US
foxconn,$154.7,1300000,$66,"New Taipei City, Taiwan",,Taiwan
alphabet,$110.8,80110,$834,"Mountain View, US",CA,US

In [38]:
#c.reindex(list(c.index)[1:])

In [39]:
a = [1, 2, 3]
b = [4, 5, 6]

In [40]:
print(a)

[1, 2, 3]

In [41]:
print(*a)

1 2 3

In [42]:
[*a, 7, 8]

[1, 2, 3, 7, 8]

In [43]:
c.reindex([*list(c.index)[1:], 'apple'])

,revenue,employees,mcap,location,state,country
samsung,$211.9,320671,$284,"Suwon, South Korea",,South Korea
amazon,$177.8,566000,$985,"Seattle, US",WA,US
foxconn,$154.7,1300000,$66,"New Taipei City, Taiwan",,Taiwan
alphabet,$110.8,80110,$834,"Mountain View, US",CA,US
apple,$229.2,123000,$1100,"Cupertino, US",CA,US

In [45]:
"""
tmp = list(c.index)[1:]
tmp.append('apple')
c.reindex(tmp)
"""

"\ntmp = list(c.index)[1:]\ntmp.append('apple')\nc.reindex(tmp)\n"

In [46]:
rain = pd.DataFrame([[3.50, 4.53, 4.13, 3.98],
                     [7.91, 5.98, 6.10, 5.12],
                     [3.94, 5.28, 3.90, 4.49],
                     [1.42, 0.63, 0.75, 1.65]],
    index=['New York', 'New Orleans', 'Atlanta', 'Seattle'],
    columns=['Jun', 'Jul', 'Aug', 'Sept'])

In [47]:
rain

              Jun   Jul   Aug  Sept
New York     3.50  4.53  4.13  3.98
New Orleans  7.91  5.98  6.10  5.12
Atlanta      3.94  5.28  3.90  4.49
Seattle      1.42  0.63  0.75  1.65

In [48]:
rain.apply(lambda arg: type(arg))

Jun     <class 'pandas.core.series.Series'>
Jul     <class 'pandas.core.series.Series'>
Aug     <class 'pandas.core.series.Series'>
Sept    <class 'pandas.core.series.Series'>
dtype: object

In [49]:
rain.apply(lambda month: sum(month), axis=0)

Jun     16.77
Jul     16.42
Aug     14.88
Sept    15.24
dtype: float64

In [50]:
rain.apply(lambda month: sum(month), axis=1)

New York       16.14
New Orleans    25.11
Atlanta        17.61
Seattle         4.45
dtype: float64

In [51]:
rain.apply(lambda month: max(month) - min(month), axis=1)

New York       1.03
New Orleans    2.79
Atlanta        1.38
Seattle        1.02
dtype: float64

In [52]:
rain.sum()

Jun     16.77
Jul     16.42
Aug     14.88
Sept    15.24
dtype: float64

In [53]:
pd.Series(['ant', 'cat', 'bat']).map(lambda word: word + 's')

0    ants
1    cats
2    bats
dtype: object

## DataFrame

* apply ... call a function on every row or col
* applymap ... call a function on every element 

## Series

* map ... call a function on every element

In [56]:
help(rain.describe)

Help on method describe in module pandas.core.generic:

describe(percentiles=None, include=None, exclude=None) method of pandas.core.frame.DataFrame instance
    Generate descriptive statistics that summarize the central tendency,
    dispersion and shape of a dataset's distribution, excluding
    ``NaN`` values.

    Analyzes both numeric and object series, as well
    as ``DataFrame`` column sets of mixed data types. The output
    will vary depending on what is provided. Refer to the notes
    below for more detail.

    Parameters
    ----------
    percentiles : list-like of numbers, optional
        The percentiles to include in the output. All should
        fall between 0 and 1. The default is
        ``[.25, .5, .75]``, which returns the 25th, 50th, and
        75th percentiles.
    include : 'all', list-like of dtypes or None (default), optional
        A white list of data types to include in the result. Ignored
        for ``Series``. Here are the options:

        - 'all' : All columns of the input will be included in the output.
        - A list-like of dtypes : Limits the results to the
          provided data types.
          To limit the result to numeric types submit
          ``numpy.number``. To limit it instead to object columns submit
          the ``numpy.object`` data type. Strings
          can also be used in the style of
          ``select_dtypes`` (e.g. ``df.describe(include=['O'])``). To
          select pandas categorical columns, use ``'category'``
        - None (default) : The result will include all numeric columns.
    exclude : list-like of dtypes or None (default), optional,
        A black list of data types to omit from the result. Ignored
        for ``Series``. Here are the options:

        - A list-like of dtypes : Excludes the provided data types
          from the result. To exclude numeric types submit
          ``numpy.number``. To exclude object columns submit the data
          type ``numpy.object``. Strings can also be used in the style of
          ``select_dtypes`` (e.g. ``df.describe(include=['O'])``). To
          exclude pandas categorical columns, use ``'category'``
        - None (default) : The result will exclude nothing.

    Returns
    -------
    Series or DataFrame
        Summary statistics of the Series or Dataframe provided.

    See Also
    --------
    DataFrame.count: Count number of non-NA/null observations.
    DataFrame.max: Maximum of the values in the object.
    DataFrame.min: Minimum of the values in the object.
    DataFrame.mean: Mean of the values.
    DataFrame.std: Standard deviation of the observations.
    DataFrame.select_dtypes: Subset of a DataFrame including/excluding
        columns based on their dtype.

    Notes
    -----
    For numeric data, the result's index will include ``count``,
    ``mean``, ``std``, ``min``, ``max`` as well as lower, ``50`` and
    upper percentiles. By default the lower percentile is ``25`` and the
    upper percentile is ``75``. The ``50`` percentile is the
    same as the median.

    For object data (e.g. strings or timestamps), the result's index
    will include ``count``, ``unique``, ``top``, and ``freq``. The ``top``
    is the most common value. The ``freq`` is the most common value's
    frequency. Timestamps also include the ``first`` and ``last`` items.

    If multiple object values have the highest count, then the
    ``count`` and ``top`` results will be arbitrarily chosen from
    among those with the highest count.

    For mixed data types provided via a ``DataFrame``, the default is to
    return only an analysis of numeric columns. If the dataframe consists
    only of object and categorical data without any numeric columns, the
    default is to return an analysis of both the object and categorical
    columns. If ``include='all'`` is provided as an option, the result
    will include a union of attributes of each type.

    The `include` and `exclude` parameters can be used to limit
    which columns in a ``DataFrame`` are analyzed for the output.
    The parameters are ignored when analyzing a ``Series``.

    Examples
    --------
    Describing a numeric ``Series``.

    >>> s = pd.Series([1, 2, 3])
    >>> s.describe()
    count    3.0
    mean     2.0
    std      1.0
    min      1.0
    25%      1.5
    50%      2.0
    75%      2.5
    max      3.0
    dtype: float64

    Describing a categorical ``Series``.

    >>> s = pd.Series(['a', 'a', 'b', 'c'])
    >>> s.describe()
    count     4
    unique    3
    top       a
    freq      2
    dtype: object

    Describing a timestamp ``Series``.

    >>> s = pd.Series([
    ...   np.datetime64("2000-01-01"),
    ...   np.datetime64("2010-01-01"),
    ...   np.datetime64("2010-01-01")
    ... ])
    >>> s.describe()
    count                       3
    unique                      2
    top       2010-01-01 00:00:00
    freq                        2
    first     2000-01-01 00:00:00
    last      2010-01-01 00:00:00
    dtype: object

    Describing a ``DataFrame``. By default only numeric fields
    are returned.

    >>> df = pd.DataFrame({'categorical': pd.Categorical(['d','e','f']),
    ...                    'numeric': [1, 2, 3],
    ...                    'object': ['a', 'b', 'c']
    ...                   })
    >>> df.describe()
           numeric
    count      3.0
    mean       2.0
    std        1.0
    min        1.0
    25%        1.5
    50%        2.0
    75%        2.5
    max        3.0

    Describing all columns of a ``DataFrame`` regardless of data type.

    >>> df.describe(include='all')
            categorical  numeric object
    count            3      3.0      3
    unique           3      NaN      3
    top              f      NaN      c
    freq             1      NaN      1
    mean           NaN      2.0    NaN
    std            NaN      1.0    NaN
    min            NaN      1.0    NaN
    25%            NaN      1.5    NaN
    50%            NaN      2.0    NaN
    75%            NaN      2.5    NaN
    max            NaN      3.0    NaN

    Describing a column from a ``DataFrame`` by accessing it as
    an attribute.

    >>> df.numeric.describe()
    count    3.0
    mean     2.0
    std      1.0
    min      1.0
    25%      1.5
    50%      2.0
    75%      2.5
    max      3.0
    Name: numeric, dtype: float64

    Including only numeric columns in a ``DataFrame`` description.

    >>> df.describe(include=[np.number])
           numeric
    count      3.0
    mean       2.0
    std        1.0
    min        1.0
    25%        1.5
    50%        2.0
    75%        2.5
    max        3.0

    Including only string columns in a ``DataFrame`` description.

    >>> df.describe(include=[np.object])
           object
    count       3
    unique      3
    top         c
    freq        1

    Including only categorical columns from a ``DataFrame`` description.

    >>> df.describe(include=['category'])
           categorical
    count            3
    unique           3
    top              f
    freq             1

    Excluding numeric columns from a ``DataFrame`` description.

    >>> df.describe(exclude=[np.number])
           categorical object
    count            3      3
    unique           3      3
    top              f      c
    freq             1      1

    Excluding object columns from a ``DataFrame`` description.

    >>> df.describe(exclude=[np.object])
           categorical  numeric
    count            3      3.0
    unique           3      NaN
    top              f      NaN
    freq             1      NaN
    mean           NaN      2.0
    std            NaN      1.0
    min            NaN      1.0
    25%            NaN      1.5
    50%            NaN      2.0
    75%            NaN      2.5
    max            NaN      3.0

In [57]:
names = ['a', 'b', 'c']

In [59]:
names[1:] + [names[0]]

['b', 'c', 'a']

In [60]:
[*list(names)[1:], 'a']

['b', 'c', 'a']

In [61]:
df = pd.DataFrame(np.arange(12).reshape((3, 4)), 
	columns=list('abcd'))
df.loc[1, 'd'] = np.nan
df.loc[2, 'c'] = np.nan

In [62]:
df

   a  b    c     d
0  0  1  2.0   3.0
1  4  5  6.0   NaN
2  8  9  NaN  11.0

In [63]:
df.dropna()

   a  b    c    d
0  0  1  2.0  3.0

In [64]:
df

   a  b    c     d
0  0  1  2.0   3.0
1  4  5  6.0   NaN
2  8  9  NaN  11.0

In [65]:
df.dropna(axis=1)

   a  b
0  0  1
1  4  5
2  8  9

In [66]:
df

   a  b    c     d
0  0  1  2.0   3.0
1  4  5  6.0   NaN
2  8  9  NaN  11.0

In [67]:
df['d'].notnull()

0     True
1    False
2     True
Name: d, dtype: bool

In [68]:

df[df['d'].notnull()]

   a  b    c     d
0  0  1  2.0   3.0
2  8  9  NaN  11.0

In [69]:
df.fillna(-1)

   a  b    c     d
0  0  1  2.0   3.0
1  4  5  6.0  -1.0
2  8  9 -1.0  11.0

In [70]:
df.fillna({'c':100, 'd':234})

   a  b      c      d
0  0  1    2.0    3.0
1  4  5    6.0  234.0
2  8  9  100.0   11.0

In [71]:
df.fillna({'c':100, 'd':df['d'].mean()})

   a  b      c     d
0  0  1    2.0   3.0
1  4  5    6.0   7.0
2  8  9  100.0  11.0

In [72]:
df.fillna(method='ffill')

   a  b    c     d
0  0  1  2.0   3.0
1  4  5  6.0   3.0
2  8  9  6.0  11.0

In [74]:
df.dtypes

a      int64
b      int64
c    float64
d    float64
dtype: object

In [75]:
df

   a  b    c     d
0  0  1  2.0   3.0
1  4  5  6.0   NaN
2  8  9  NaN  11.0

In [78]:
df.count()

a    3
b    3
c    2
d    2
dtype: int64

In [79]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 3 entries, 0 to 2
Data columns (total 4 columns):
a    3 non-null int64
b    3 non-null int64
c    2 non-null float64
d    2 non-null float64
dtypes: float64(2), int64(2)
memory usage: 224.0 bytes

In [80]:
df['a'].astype('float64')

0    0.0
1    4.0
2    8.0
Name: a, dtype: float64

In [81]:
df['d'].astype('float64')

0     3.0
1     NaN
2    11.0
Name: d, dtype: float64

In [116]:
df = pd.read_csv('./DOHMH_Dog_Bite_Data (1).csv')

In [83]:
df

,UniqueID,DateOfBite,Species,Breed,Age,Gender,SpayNeuter,Borough,ZipCode
0,1,January 02 2015,DOG,"Poodle, Standard",3,M,True,Brooklyn,11238
1,2,January 02 2015,DOG,HUSKY,NaN,U,False,Brooklyn,11249
2,3,January 02 2015,DOG,NaN,NaN,U,False,Brooklyn,NaN
3,4,January 01 2015,DOG,American Pit Bull Terrier/Pit Bull,6,M,False,Brooklyn,11221
4,5,January 03 2015,DOG,American Pit Bull Terrier/Pit Bull,1,M,False,Brooklyn,11207
...,...,...,...,...,...,...,...,...,...
10275,10276,December 24 2017,DOG,CHIWEENIE MIX,7,M,True,Staten Island,10303
10276,10277,December 24 2017,DOG,DUNKER,5,F,True,Staten Island,10303
10277,10278,December 21 2017,DOG,"Schnauzer, Miniature",10M,M,True,Staten Island,10312
10278,10279,December 28 2017,DOG,Mixed/Other,NaN,F,False,Staten Island,10308
10279,10280,December 29 2017,DOG,BOXER/PIT BULL,NaN,M,False,Staten Island,10314

In [84]:
df.head(5)

,UniqueID,DateOfBite,Species,Breed,Age,Gender,SpayNeuter,Borough,ZipCode
0,1,January 02 2015,DOG,"Poodle, Standard",3,M,True,Brooklyn,11238
1,2,January 02 2015,DOG,HUSKY,NaN,U,False,Brooklyn,11249
2,3,January 02 2015,DOG,NaN,NaN,U,False,Brooklyn,NaN
3,4,January 01 2015,DOG,American Pit Bull Terrier/Pit Bull,6,M,False,Brooklyn,11221
4,5,January 03 2015,DOG,American Pit Bull Terrier/Pit Bull,1,M,False,Brooklyn,11207

In [85]:
df.tail(5)

,UniqueID,DateOfBite,Species,Breed,Age,Gender,SpayNeuter,Borough,ZipCode
10275,10276,December 24 2017,DOG,CHIWEENIE MIX,7,M,True,Staten Island,10303
10276,10277,December 24 2017,DOG,DUNKER,5,F,True,Staten Island,10303
10277,10278,December 21 2017,DOG,"Schnauzer, Miniature",10M,M,True,Staten Island,10312
10278,10279,December 28 2017,DOG,Mixed/Other,NaN,F,False,Staten Island,10308
10279,10280,December 29 2017,DOG,BOXER/PIT BULL,NaN,M,False,Staten Island,10314

In [86]:
df.sample(10)

,UniqueID,DateOfBite,Species,Breed,Age,Gender,SpayNeuter,Borough,ZipCode
8149,8150,July 19 2016,DOG,Pit Bull,NaN,U,False,Queens,11694
8739,8740,May 14 2017,DOG,NEWFOUNDLAND OR TIBETAN MASTIFF,NaN,U,False,Queens,11364
10247,10248,November 15 2017,DOG,Pointer,NaN,U,False,Staten Island,NaN
7841,7842,March 28 2016,DOG,"Poodle, Miniature",17,M,False,Queens,11411
1020,1021,May 20 2016,DOG,Mixed/Other,5,M,False,Brooklyn,11216
9859,9860,August 16 2016,DOG,Mixed/Other,NaN,U,False,Staten Island,10314
1820,1821,June 13 2017,DOG,TERRIER,NaN,U,False,Brooklyn,11216
8925,8926,May 16 2017,DOG,Pit Bull,2,F,True,Queens,11418
169,170,April 19 2015,DOG,ITALIAN MASTIFF,3,F,False,Brooklyn,11221
7750,7751,February 14 2016,DOG,Golden Retriever,2,M,True,Queens,11385

In [87]:
df.dtypes

UniqueID       int64
DateOfBite    object
Species       object
Breed         object
Age           object
Gender        object
SpayNeuter      bool
Borough       object
ZipCode       object
dtype: object

In [88]:
df.count()

UniqueID      10280
DateOfBite    10280
Species       10280
Breed          8692
Age            5534
Gender        10280
SpayNeuter    10280
Borough       10280
ZipCode        7613
dtype: int64

In [89]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10280 entries, 0 to 10279
Data columns (total 9 columns):
UniqueID      10280 non-null int64
DateOfBite    10280 non-null object
Species       10280 non-null object
Breed         8692 non-null object
Age           5534 non-null object
Gender        10280 non-null object
SpayNeuter    10280 non-null bool
Borough       10280 non-null object
ZipCode       7613 non-null object
dtypes: bool(1), int64(1), object(7)
memory usage: 652.7+ KB

In [90]:
df.describe()

           UniqueID
count  10280.000000
mean    5140.500000
std     2967.724718
min        1.000000
25%     2570.750000
50%     5140.500000
75%     7710.250000
max    10280.000000

In [91]:
df['Age']

0          3
1        NaN
2        NaN
3          6
4          1
        ...
10275      7
10276      5
10277    10M
10278    NaN
10279    NaN
Name: Age, Length: 10280, dtype: object

In [92]:
df['Age'].value_counts()

2                          835
3                          748
1                          665
4                          556
5                          514
                          ...
2018-08-09T00:00:00.000      1
2018-04-02T00:00:00.000      1
10.5                         1
10y                          1
2018-09-10T00:00:00.000      1
Name: Age, Length: 153, dtype: int64

In [93]:
df['Age'].map(lambda age: type(age)).value_counts()

<class 'str'>      5534
<class 'float'>    4746
Name: Age, dtype: int64

In [94]:
df['Age'].isnull().value_counts()

False    5534
True     4746
Name: Age, dtype: int64

In [95]:
df['Age'].astype('float64')

ValueError: could not convert string to float: '7M'

In [96]:
df['Age'].value_counts()

2                          835
3                          748
1                          665
4                          556
5                          514
                          ...
2018-08-09T00:00:00.000      1
2018-04-02T00:00:00.000      1
10.5                         1
10y                          1
2018-09-10T00:00:00.000      1
Name: Age, Length: 153, dtype: int64

In [98]:
with pd.option_context('display.max_rows', 200):
    print(df['Age'].value_counts())

2                          835
3                          748
1                          665
4                          556
5                          514
6                          386
7                          324
8                          286
9                          167
10                         159
11                         101
12                          69
13                          57
14                          33
8M                          32
4M                          31
10M                         30
11M                         28
2Y                          27
3M                          26
3Y                          24
15                          22
9M                          22
5M                          21
1Y                          20
7M                          20
6M                          18
4Y                          16
6Y                          15
5Y                          13
2M                          12
16                          12
10Y                         10
10 MTHS                      9
12Y                          7
8 MTHS                       7
9 MTHS                       7
2 YRS                        7
8Y                           7
7 MTHS                       6
9Y                           6
11 MTHS                      6
2.5                          6
3 MTHS                       5
4 MTHS                       5
3 M                          4
2018-04-05T00:00:00.000      4
4 YRS                        4
13Y                          4
6 MTHS                       4
1 1/2 YRS                    4
4MTHS                        3
11Y                          3
3 YRS                        3
2018-03-04T00:00:00.000      3
1 YR                         3
6 YRS                        3
17                           3
9MTHS                        2
1.3                          2
4y                           2
3.5                          2
10 M                         2
1.5                          2
16M                          2
13M                          2
2 & 9MTHS                    2
8 YRS                        2
1.6                          2
1M                           2
4.6                          2
2 MTHS                       2
5 MTHS                       2
2y                           2
10 YRS                       2
3.6                          1
11 YRS                       1
11MTHS                       1
13 YRS                       1
1YR                          1
11MOS                        1
7 M                          1
21                           1
2.6                          1
11W                          1
12WKS                        1
2018-05-06T00:00:00.000      1
6MTH                         1
5m                           1
2 MTH                        1
9 YRS                        1
4 M                          1
11 M                         1
7W                           1
2018-06-09T00:00:00.000      1
4 yrs 8 mo                   1
8MTHS                        1
3 YR                         1
14M                          1
3MTH                         1
3YR                          1
6y                           1
8W                           1
2018-06-07T00:00:00.000      1
2018-04-06T00:00:00.000      1
2-3 YRS                      1
4.5                          1
11m                          1
10 MTHS &                    1
9 M                          1
18W                          1
8 MOS                        1
1.8                          1
0.2                          1
2018-02-03T00:00:00.000      1
22 MTHS                      1
41                           1
15.5                         1
17y                          1
7Y                           1
6.5                          1
19                           1
1 & 3                        1
1/12M                        1
6.5 YRS                      1
2018-07-03T00:00:00.000      1
2-3 YR                       1
13WK                         1
2YRS (MALE                   1
3 & 4                        1
7m                           1
15M                          1
18M                          1
2018-01-01T00:00:00.000      1
2-3M                         1
8 M                          1
10 & 9                       1
8YRS & 8 M                   1
15 YRS                       1
9WK                          1
1 & 8                        1
0.6                          1
3y                           1
2 (2) & (1                   1
8WKS                         1
6 & 4                        1
5YR                          1
2018-08-02T00:00:00.000      1
2018-08-09T00:00:00.000      1
2018-04-02T00:00:00.000      1
10.5                         1
10y                          1
2018-09-10T00:00:00.000      1
Name: Age, dtype: int64

In [108]:
def normalize_age(s):
    if isinstance(s, float):
        return s
    
    month_endings = ['M', 'MTHS', 'm']
    year_endings = ['Y', 'YRS']
    
    for ending in month_endings + year_endings:
        age = s.replace(ending, '').strip()
        if age.isnumeric():
            if ending.endswith(s):
                return str(int(age) / 12)
            elif ending.endswith(s):
                return age
        
    return s

In [109]:
normalize_age(np.nan)

nan

In [110]:

normalize_age('5m')

'0.4166666666666667'

In [111]:
df['Age'].map(normalize_age)

0                       0.25
1                        NaN
2                        NaN
3                        0.5
4        0.08333333333333333
                ...
10275     0.5833333333333334
10276     0.4166666666666667
10277     0.8333333333333334
10278                    NaN
10279                    NaN
Name: Age, Length: 10280, dtype: object

In [117]:
df['Age'].map(normalize_age).value_counts()

0.16666666666666666        849
0.25                       783
0.08333333333333333        667
0.3333333333333333         596
0.4166666666666667         538
                          ...
8WKS                         1
10y                          1
2018-08-09T00:00:00.000      1
2018-08-02T00:00:00.000      1
1.5833333333333333           1
Name: Age, Length: 104, dtype: int64

In [118]:
df['Age'] = df['Age'].map(normalize_age)

In [120]:
df['Age'].value_counts()

0.16666666666666666        849
0.25                       783
0.08333333333333333        667
0.3333333333333333         596
0.4166666666666667         538
                          ...
8WKS                         1
10y                          1
2018-08-09T00:00:00.000      1
2018-08-02T00:00:00.000      1
1.5833333333333333           1
Name: Age, Length: 104, dtype: int64

In [124]:
df['Age'] = pd.to_numeric(df['Age'], errors='coerce')

In [125]:
df.describe()

           UniqueID          Age
count  10280.000000  5467.000000
mean    5140.500000     0.566590
std     2967.724718     1.106275
min        1.000000     0.083333
25%     2570.750000     0.166667
50%     5140.500000     0.333333
75%     7710.250000     0.583333
max    10280.000000    15.500000

In [126]:
df['Breed'].value_counts()

Pit Bull                                1921
Shih Tzu                                 364
American Pit Bull Terrier/Pit Bull       349
Chihuahua                                344
American Pit Bull Mix / Pit Bull Mix     340
                                        ...
WEST HIGHLAND TERR                         1
ROTWEILLER/LABRADOR RETRIEVER              1
CHOW/SHEPHERD X                            1
SIBERIAN PIT BULL                          1
ROTTWEILER/BOXER                           1
Name: Breed, Length: 1032, dtype: int64